app/Controllers/Admin/AdminBaseController.php

    protected function logActivity(string $action, ?string $description = null, array $context = [], ?int $adminUserId = null): void
    {
        try {
            if ($adminUserId === null) {
                $adminUserId = (int) ($this->adminUser()['id'] ?? 0);
                if ($adminUserId <= 0) {
                    $adminUserId = null;
                }
            }

            $targetType = isset($context['target_type']) ? (string) $context['target_type'] : null;
            $targetId = isset($context['target_id']) ? (int) $context['target_id'] : null;

            $metadata = $context;
            unset($metadata['target_type'], $metadata['target_id']);

            $model = new AdminActivityLogModel();
            $model->insert([
                'admin_user_id' => $adminUserId,
                'action'        => $action,
                'target_type'   => $targetType,
                'target_id'     => $targetId,
                'description'   => $description,
                'metadata'      => $metadata !== [] ? json_encode($metadata, JSON_UNESCAPED_SLASHES) : null,
                'ip_address'    => method_exists($this->request, 'getIPAddress') ? (string) $this->request->getIPAddress() : null,
                'user_agent'    => method_exists($this->request, 'getUserAgent') ? substr((string) $this->request->getUserAgent(), 0, 255) : null,
                'created_at'    => date('Y-m-d H:i:s'),
            ]);
---
INSERT INTO `admin_activity_logs` (`admin_user_id`, `action`, `target_type`, `target_id`, `description`, `metadata`, `ip_address`, `user_agent`, `created_at`) VALUES (1, 'auth.login', 'admin_user', 1, 'Admin logged into control panel.', '{\"email\":\"sysadmin@campusvoice.local\",\"role\":\"system_admin\"}', '::1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/145.0.0.0 Safari/537.36', '2026-03-19 06:14:39')