app/Controllers/Admin/AuthController.php

            // Fallback: authenticate against active admin users from users table.
            if (! $passwordMatch) {
                $userModel = new UserModel();
                $adminUser = $userModel
                    ->select('users.id, users.first_name, users.last_name, users.email, users.password_hash, roles.name as role')
                    ->join('roles', 'roles.id = users.role_id', 'left')
                    ->whereIn('roles.name', ['admin', 'system_admin'])
                    ->where('users.is_active', 1)
                    ->first();
---
SELECT `users`.`id`, `users`.`first_name`, `users`.`last_name`, `users`.`email`, `users`.`password_hash`, `roles`.`name` as `role`
FROM `users`
LEFT JOIN `roles` ON `roles`.`id` = `users`.`role_id`
WHERE `roles`.`name` IN ('admin','system_admin')
AND `users`.`is_active` = 1
AND `users`.`deleted_at` IS NULL
 LIMIT 1