app/Controllers/Admin/DashboardController.php

    public function index(): string
    {
        $adminUser = $this->adminUser();
        $canViewActivity = in_array($adminUser['role'] ?? '', ['system_admin', 'admin'], true);

        $requestedTab = (string) ($this->request->getGet('tab') ?? 'overview');
        $allowedTabs = ['overview', 'feedback', 'announcements', 'users', 'categories'];
        if ($canViewActivity) {
            $allowedTabs[] = 'activity';
        }

        $panelTab = in_array($requestedTab, $allowedTabs, true) ? $requestedTab : 'overview';

        $stats = [
            'feedback_total'     => (new FeedbackModel())->countAllResults(),
            'feedback_pending'   => (new FeedbackModel())->where('status', 'pending')->countAllResults(),
            'feedback_approved'  => (new FeedbackModel())->where('status', 'approved')->countAllResults(),
            'feedback_rejected'  => (new FeedbackModel())->where('status', 'rejected')->countAllResults(),
            'feedback_reviewed'  => (new FeedbackModel())->where('status', 'reviewed')->countAllResults(),
            'feedback_resolved'  => (new FeedbackModel())->where('status', 'resolved')->countAllResults(),
            'student_total'      => (new UserModel())
                ->join('roles', 'roles.id = users.role_id', 'left')
                ->where('roles.name', 'student')
                ->countAllResults(),
            'announcement_total' => (new AnnouncementModel())->countAllResults(),
        ];

        $latestFeedback = (new FeedbackModel())
            ->select('feedbacks.id, feedbacks.type, feedbacks.subject, feedbacks.status, feedbacks.created_at, feedback_categories.name as category_name, users.first_name, users.last_name, feedbacks.is_anonymous')
            ->join('feedback_categories', 'feedback_categories.id = feedbacks.category_id', 'left')
            ->join('users', 'users.id = feedbacks.user_id', 'left')
            ->orderBy('feedbacks.created_at', 'DESC')
            ->findAll(10);

        $feedbackList = (new FeedbackModel())
            ->select('feedbacks.*, feedback_categories.name as category_name, users.first_name, users.last_name, users.email')
            ->join('feedback_categories', 'feedback_categories.id = feedbacks.category_id', 'left')
            ->join('users', 'users.id = feedbacks.user_id', 'left')
            ->orderBy('feedbacks.created_at', 'DESC')
            ->findAll(200);

        $latestAnnouncements = (new AnnouncementModel())
            ->select('announcements.id, announcements.title, announcements.audience, announcements.is_published, announcements.publish_at, announcements.created_at, users.first_name, users.last_name')
            ->join('users', 'users.id = announcements.posted_by', 'left')
            ->orderBy('announcements.created_at', 'DESC')
            ->findAll(5);

        $announcements = (new AnnouncementModel())
            ->select('announcements.*, users.first_name, users.last_name')
            ->join('users', 'users.id = announcements.posted_by', 'left')
            ->orderBy('announcements.created_at', 'DESC')
            ->findAll(200);

        $categories = (new FeedbackCategoryModel())
            ->where('is_active', 1)
            ->orderBy('name', 'ASC')
            ->findAll();

        $allCategories = (new FeedbackCategoryModel())
            ->orderBy('name', 'ASC')
            ->findAll();

        $usersList = (new UserModel())
            ->select('users.*, roles.name as role')
            ->join('roles', 'roles.id = users.role_id', 'left')
            ->where('roles.name', 'student')
            ->orderBy('users.created_at', 'DESC')
            ->findAll(500);
---
SELECT COUNT(*) AS `numrows`
FROM `feedbacks`
WHERE `status` = 'new'
AND `feedbacks`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `feedbacks`
WHERE `status` = 'reviewed'
AND `feedbacks`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `feedbacks`
WHERE `status` = 'resolved'
AND `feedbacks`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `users`
LEFT JOIN `roles` ON `roles`.`id` = `users`.`role_id`
WHERE `roles`.`name` = 'student'
AND `users`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `announcements`
SELECT `feedbacks`.`id`, `feedbacks`.`type`, `feedbacks`.`subject`, `feedbacks`.`status`, `feedbacks`.`created_at`, `feedback_categories`.`name` as `category_name`, `users`.`first_name`, `users`.`last_name`, `feedbacks`.`is_anonymous`
FROM `feedbacks`
LEFT JOIN `feedback_categories` ON `feedback_categories`.`id` = `feedbacks`.`category_id`
LEFT JOIN `users` ON `users`.`id` = `feedbacks`.`user_id`
WHERE `feedbacks`.`deleted_at` IS NULL
ORDER BY `feedbacks`.`created_at` DESC
 LIMIT 10
SELECT `feedbacks`.*, `feedback_categories`.`name` as `category_name`, `users`.`first_name`, `users`.`last_name`, `users`.`email`
FROM `feedbacks`
LEFT JOIN `feedback_categories` ON `feedback_categories`.`id` = `feedbacks`.`category_id`
LEFT JOIN `users` ON `users`.`id` = `feedbacks`.`user_id`
WHERE `feedbacks`.`deleted_at` IS NULL
ORDER BY `feedbacks`.`created_at` DESC
 LIMIT 200
SELECT `announcements`.`id`, `announcements`.`title`, `announcements`.`audience`, `announcements`.`is_published`, `announcements`.`publish_at`, `announcements`.`created_at`, `users`.`first_name`, `users`.`last_name`
FROM `announcements`
LEFT JOIN `users` ON `users`.`id` = `announcements`.`posted_by`
ORDER BY `announcements`.`created_at` DESC
 LIMIT 5
SELECT `announcements`.*, `users`.`first_name`, `users`.`last_name`
FROM `announcements`
LEFT JOIN `users` ON `users`.`id` = `announcements`.`posted_by`
ORDER BY `announcements`.`created_at` DESC
 LIMIT 200
SELECT *
FROM `feedback_categories`
WHERE `is_active` = 1
ORDER BY `name` ASC
SELECT *
FROM `feedback_categories`
ORDER BY `name` ASC
SELECT `users`.*, `roles`.`name` as `role`
FROM `users`
LEFT JOIN `roles` ON `roles`.`id` = `users`.`role_id`
WHERE `roles`.`name` = 'student'
AND `users`.`deleted_at` IS NULL
ORDER BY `users`.`created_at` DESC
 LIMIT 500

                    ->findAll($activityPagination['perPage'], $offset);
            }

            $activityToday = (new AdminActivityLogModel())
                ->where('DATE(created_at)', date('Y-m-d'))
                ->countAllResults();

            $activityActionRows = (new AdminActivityLogModel())
                ->select('action')
                ->groupBy('action')
                ->orderBy('action', 'ASC')
                ->findAll();
---
SELECT COUNT(*) AS `numrows`
FROM `admin_activity_logs`
WHERE DATE(created_at) = '2026-03-19'
SELECT `action`
FROM `admin_activity_logs`
GROUP BY `action`
ORDER BY `action` ASC

                return (string) ($row['action'] ?? '');
            }, $activityActionRows)));

            $activityAdminOptions = (new UserModel())
                ->select('users.id, users.first_name, users.last_name, users.email')
                ->join('roles', 'roles.id = users.role_id', 'left')
                ->whereIn('roles.name', ['system_admin', 'admin'])
                ->where('users.is_active', 1)
                ->orderBy('users.first_name', 'ASC')
                ->orderBy('users.last_name', 'ASC')
                ->findAll();
---
SELECT `users`.`id`, `users`.`first_name`, `users`.`last_name`, `users`.`email`
FROM `users`
LEFT JOIN `roles` ON `roles`.`id` = `users`.`role_id`
WHERE `roles`.`name` IN ('system_admin','admin')
AND `users`.`is_active` = 1
AND `users`.`deleted_at` IS NULL
ORDER BY `users`.`first_name` ASC, `users`.`last_name` ASC