app/Controllers/Student/AuthController.php

    private function handleLogin()
    {
        $post = $this->request->getPost();

        // Verify reCAPTCHA
        $recaptchaResponse = (string) ($post['g-recaptcha-response'] ?? '');
        if (!$this->verifyRecaptcha($recaptchaResponse)) {
            return redirect()->to(site_url('users/login?mode=login'))->with('error', 'Please complete the CAPTCHA verification.')->withInput();
        }

        $rules = [
            'email'    => 'required|valid_email',
            'password' => 'required',
        ];

        if (! $this->validateData($post, $rules)) {
            return redirect()->to(site_url('users/login?mode=login'))->with('error', implode(' ', $this->validator->getErrors()))->withInput();
        }

        $email    = strtolower(trim((string) ($post['email'] ?? '')));
        $password = (string) ($post['password'] ?? '');

        $userModel = new UserModel();
        $user = $userModel
            ->select('users.*, roles.name as role')
            ->join('roles', 'roles.id = users.role_id', 'left')
            ->where('users.email', $email)
            ->first();
---
SELECT `users`.*, `roles`.`name` as `role`
FROM `users`
LEFT JOIN `roles` ON `roles`.`id` = `users`.`role_id`
WHERE `users`.`email` = 'lilflickone12@gmail.com'
AND `users`.`deleted_at` IS NULL
 LIMIT 1

            return redirect()->to(site_url('users/login?mode=login'))->with('error', 'Your account is inactive. Please contact the administrator.')->withInput();
        }

        $userModel->update((int) $user['id'], ['last_login_at' => date('Y-m-d H:i:s')]);
---
UPDATE `users` SET `last_login_at` = '2026-03-24 09:55:47', `updated_at` = '2026-03-24 09:55:47'
WHERE `users`.`id` IN (5)

    public function sendForgotOtp()
    {
        session()->remove('forgot_password_reset');
        $email = strtolower(trim((string) ($this->request->getPost('email') ?? '')));

        if ($email === '' || ! filter_var($email, FILTER_VALIDATE_EMAIL)) {
            return $this->response->setStatusCode(422)->setJSON([
                'ok'      => false,
                'message' => 'Please enter a valid email address.',
            ]);
        }

        $userModel = new UserModel();
        $user = $userModel->where('email', $email)->where('is_active', 1)->first();

        // Always return OK to prevent email enumeration.
        if ($user === null) {
            return $this->response->setJSON([
                'ok'      => true,
                'message' => 'If that email is registered, an OTP has been sent.',
            ]);
        }

        $now      = date('Y-m-d H:i:s');
        $otpModel = new PasswordOtpModel();

        $recentRequest = $otpModel
            ->where('email', $email)
            ->where('purpose', 'reset')
            ->where('used_at', null)
            ->where('expires_at >=', $now)
            ->orderBy('id', 'DESC')
            ->first();
---
SELECT *
FROM `users`
WHERE `email` = 'lilflickone12@gmail.com'
AND `is_active` = 1
AND `users`.`deleted_at` IS NULL
 LIMIT 1
SELECT *
FROM `password_otps`
WHERE `email` = 'lilflickone12@gmail.com'
AND `purpose` = 'reset'
AND `used_at` IS NULL
AND `expires_at` >= '2026-03-24 09:50:16'
ORDER BY `id` DESC
 LIMIT 1

        }

        $userModel = new UserModel();
        $user = $userModel->where('email', $email)->where('is_active', 1)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'lilflickone12@gmail.com'
AND `is_active` = 1
AND `users`.`deleted_at` IS NULL
 LIMIT 1

                ->withInput();
        }

        $userModel->update((int) $user['id'], [
            'password_hash' => password_hash($password, PASSWORD_DEFAULT),
        ]);
---
UPDATE `users` SET `password_hash` = '$2y$10$BcvEmF4qTMzENxTMEXr5uuVBSx2xVbV81CT7TuoKd6iMOeJrLk0BC', `updated_at` = '2026-03-24 09:55:40'
WHERE `users`.`id` IN (5)

    private function verifyResetOtp(string $email, string $otp, bool $consume): bool
    {
        $now = date('Y-m-d H:i:s');
        $otpModel = new PasswordOtpModel();

        $records = $otpModel
            ->where('email', $email)
            ->where('purpose', 'reset')
            ->where('used_at', null)
            ->where('expires_at >=', $now)
            ->orderBy('id', 'DESC')
            ->findAll(5);

        if ($records === []) {
            return false;
        }

        $recordToIncrement = null;

        foreach ($records as $record) {
            if ((int) $record['attempts'] >= (int) $record['max_attempts']) {
                continue;
            }

            if ($recordToIncrement === null) {
                $recordToIncrement = $record;
            }

            if (password_verify($otp, (string) $record['otp_hash'])) {
                if ($consume) {
                    $otpModel->update((int) $record['id'], ['used_at' => $now]);
---
SELECT *
FROM `password_otps`
WHERE `email` = 'lilflickone12@gmail.com'
AND `purpose` = 'reset'
AND `used_at` IS NULL
AND `expires_at` >= '2026-03-24 09:55:40'
ORDER BY `id` DESC
 LIMIT 5
UPDATE `password_otps` SET `used_at` = '2026-03-24 09:55:40', `updated_at` = '2026-03-24 09:55:40'
WHERE `password_otps`.`id` IN (14)