app/Controllers/Student/PortalController.php

    public function index(): string
    {
        $studentUser = $this->studentUser();
        $userId = (int) ($studentUser['id'] ?? 0);

        $myFeedback = (new FeedbackModel())
            ->select('feedbacks.*, feedback_categories.name as category_name')
            ->join('feedback_categories', 'feedback_categories.id = feedbacks.category_id', 'left')
            ->where('feedbacks.user_id', $userId)
            ->orderBy('feedbacks.created_at', 'DESC')
            ->findAll(5);

        $announcements = (new AnnouncementModel())
            ->where('is_published', 1)
            ->groupStart()
                ->where('expires_at IS NULL')
                ->orWhere('expires_at >=', date('Y-m-d H:i:s'))
            ->groupEnd()
            ->orderBy('created_at', 'DESC')
            ->findAll(5);

        $stats = [
            'total'    => (new FeedbackModel())->where('user_id', $userId)->countAllResults(),
            'new'      => (new FeedbackModel())->where('user_id', $userId)->where('status', 'new')->countAllResults(),
            'reviewed' => (new FeedbackModel())->where('user_id', $userId)->where('status', 'reviewed')->countAllResults(),
            'resolved' => (new FeedbackModel())->where('user_id', $userId)->where('status', 'resolved')->countAllResults(),
---
SELECT COUNT(*) AS `numrows`
FROM `feedbacks`
WHERE `user_id` = 5
AND `status` = 'new'
AND `feedbacks`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `feedbacks`
WHERE `user_id` = 5
AND `status` = 'reviewed'
AND `feedbacks`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `feedbacks`
WHERE `user_id` = 5
AND `status` = 'resolved'
AND `feedbacks`.`deleted_at` IS NULL