app/Controllers/Student/PortalController.php

SELECT *
FROM `social_profiles`
WHERE `user_id` = 5
 LIMIT 1
---
    private function anonViewData(int $userId): array
    {
        $profile = (new SocialProfileModel())->where('user_id', $userId)->first();

SELECT `feedbacks`.*, `feedback_categories`.`name` as `category_name`
FROM `feedbacks`
LEFT JOIN `feedback_categories` ON `feedback_categories`.`id` = `feedbacks`.`category_id`
WHERE `feedbacks`.`user_id` = 5
AND `feedbacks`.`deleted_at` IS NULL
ORDER BY `feedbacks`.`created_at` DESC
 LIMIT 5
SELECT *
FROM `announcements`
WHERE `is_published` = 1
AND   (
`expires_at` IS NULL
OR `expires_at` >= '2026-04-22 08:58:22'
 )
ORDER BY `created_at` DESC
 LIMIT 5
SELECT *
FROM `social_profiles`
WHERE `user_id` = 5
 LIMIT 1
---
    public function index(): string
    {
        $studentUser = $this->studentUser();
        $userId = (int) ($studentUser['id'] ?? 0);

        $myFeedback = (new FeedbackModel())
            ->select('feedbacks.*, feedback_categories.name as category_name')
            ->join('feedback_categories', 'feedback_categories.id = feedbacks.category_id', 'left')
            ->where('feedbacks.user_id', $userId)
            ->orderBy('feedbacks.created_at', 'DESC')
            ->findAll(5);

        $announcements = (new AnnouncementModel())
            ->where('is_published', 1)
            ->groupStart()
                ->where('expires_at IS NULL')
                ->orWhere('expires_at >=', date('Y-m-d H:i:s'))
            ->groupEnd()
            ->orderBy('created_at', 'DESC')
            ->findAll(5);

        $profileModel = new SocialProfileModel();
        $profile = $profileModel->where('user_id', $userId)->first();

SELECT `feedbacks`.*, `feedback_categories`.`name` as `category_name`
FROM `feedbacks`
LEFT JOIN `feedback_categories` ON `feedback_categories`.`id` = `feedbacks`.`category_id`
WHERE `feedbacks`.`user_id` = 5
AND `feedbacks`.`deleted_at` IS NULL
ORDER BY `feedbacks`.`created_at` DESC
 LIMIT 200
---
    public function myFeedback(): string
    {
        $studentUser = $this->studentUser();
        $userId = (int) ($studentUser['id'] ?? 0);

        $feedbackList = (new FeedbackModel())
            ->select('feedbacks.*, feedback_categories.name as category_name')
            ->join('feedback_categories', 'feedback_categories.id = feedbacks.category_id', 'left')
            ->where('feedbacks.user_id', $userId)
            ->orderBy('feedbacks.created_at', 'DESC')
            ->findAll(200);

SELECT *
FROM `feedbacks`
WHERE `id` = 12
AND `user_id` = 5
AND `feedbacks`.`deleted_at` IS NULL
 LIMIT 1
UPDATE `feedbacks` SET `deleted_at` = '2026-03-30 06:43:10', `updated_at` = '2026-03-30 06:43:10'
WHERE `id` IN (12)
AND `deleted_at` IS NULL
---
    public function deleteFeedback(int $id)
    {
        $studentUser = $this->studentUser();
        $userId = (int) ($studentUser['id'] ?? 0);

        $feedbackModel = new FeedbackModel();
        $feedback = $feedbackModel
            ->where('id', $id)
            ->where('user_id', $userId)
            ->first();

        if ($feedback === null) {
            return redirect()->to(site_url('users/feedback'))->with('error', 'Feedback not found or you do not have access.');
        }

        $feedbackModel->delete((int) $feedback['id']);

SELECT `social_posts`.*, `users`.`first_name`, `users`.`last_name`, `social_profiles`.`avatar_color`, `social_profiles`.`is_anonymous` as `profile_is_anonymous`
FROM `social_posts`
INNER JOIN `users` ON `users`.`id` = `social_posts`.`user_id`
LEFT JOIN `social_profiles` ON `social_profiles`.`user_id` = `users`.`id`
WHERE `users`.`is_active` = 1
AND `social_posts`.`is_public` = 1
AND `social_posts`.`deleted_at` IS NULL
ORDER BY `social_posts`.`created_at` DESC
 LIMIT 12
SELECT `post_id`, `reaction_type`, COUNT(*) as total
FROM `social_post_reactions`
WHERE `post_id` IN (29)
GROUP BY `post_id`, `reaction_type`
---
    private function buildCommunityPosts(int $viewerId): array
    {
        $posts = (new SocialPostModel())
            ->select('social_posts.*, users.first_name, users.last_name, social_profiles.avatar_color, social_profiles.is_anonymous as profile_is_anonymous')
            ->join('users', 'users.id = social_posts.user_id', 'inner')
            ->join('social_profiles', 'social_profiles.user_id = users.id', 'left')
            ->where('users.is_active', 1)
            ->where('social_posts.is_public', 1)
            ->orderBy('social_posts.created_at', 'DESC')
            ->findAll(12);

        if ($posts === []) {
            return [];
        }

        $postIds = array_map(static fn (array $post): int => (int) $post['id'], $posts);
        $db = db_connect();

        $reactionRows = $db->table('social_post_reactions')
            ->select('post_id, reaction_type, COUNT(*) as total')
            ->whereIn('post_id', $postIds)
            ->groupBy('post_id, reaction_type')
            ->get()
            ->getResultArray();

SELECT `post_id`, `reaction_type`
FROM `social_post_reactions`
WHERE `user_id` = 5
AND `post_id` IN (29)
---
        }

        $viewerReactions = [];
        $viewerReactionRows = $db->table('social_post_reactions')
            ->select('post_id, reaction_type')
            ->where('user_id', $viewerId)
            ->whereIn('post_id', $postIds)
            ->get()
            ->getResultArray();

SELECT `post_id`, COUNT(*) as total
FROM `social_post_shares`
WHERE `post_id` IN (29)
GROUP BY `post_id`
---
            $viewerReactions[(int) $row['post_id']] = (string) $row['reaction_type'];
        }

        $shareRows = $db->table('social_post_shares')
            ->select('post_id, COUNT(*) as total')
            ->whereIn('post_id', $postIds)
            ->groupBy('post_id')
            ->get()
            ->getResultArray();

SELECT `social_post_comments`.*, `users`.`first_name`, `users`.`last_name`, `social_profiles`.`avatar_color`, `social_profiles`.`is_anonymous` as `profile_is_anonymous`
FROM `social_post_comments`
INNER JOIN `users` ON `users`.`id` = `social_post_comments`.`user_id`
LEFT JOIN `social_profiles` ON `social_profiles`.`user_id` = `users`.`id`
WHERE `social_post_comments`.`post_id` IN (29)
AND `social_post_comments`.`deleted_at` IS NULL
ORDER BY `social_post_comments`.`created_at` DESC
---
            $shareTotals[(int) $row['post_id']] = (int) $row['total'];
        }

        $commentRows = $db->table('social_post_comments')
            ->select('social_post_comments.*, users.first_name, users.last_name, social_profiles.avatar_color, social_profiles.is_anonymous as profile_is_anonymous')
            ->join('users', 'users.id = social_post_comments.user_id', 'inner')
            ->join('social_profiles', 'social_profiles.user_id = users.id', 'left')
            ->whereIn('social_post_comments.post_id', $postIds)
            ->where('social_post_comments.deleted_at', null)
            ->orderBy('social_post_comments.created_at', 'DESC')
            ->get()
            ->getResultArray();

SELECT `comment_id`, `reaction_type`, COUNT(*) as total
FROM `comment_reactions`
WHERE `comment_id` IN (47)
GROUP BY `comment_id`, `reaction_type`
---
        $commentReactionBreakdown = [];
        $commentViewerReactions = [];
        if ($allCommentIds !== []) {
            $crRows = $db->table('comment_reactions')
                ->select('comment_id, reaction_type, COUNT(*) as total')
                ->whereIn('comment_id', $allCommentIds)
                ->groupBy('comment_id, reaction_type')
                ->get()->getResultArray();

SELECT `comment_id`, `reaction_type`
FROM `comment_reactions`
WHERE `user_id` = 5
AND `comment_id` IN (47)
---
            }

            if ($viewerId > 0) {
                $crViewerRows = $db->table('comment_reactions')
                    ->select('comment_id, reaction_type')
                    ->where('user_id', $viewerId)
                    ->whereIn('comment_id', $allCommentIds)
                    ->get()->getResultArray();