app/Controllers/SocialController.php

            'currentUser'        => $viewer,
            'currentUserProfile' => $settingsProfile,
            'avatarPalette'      => $this->avatarPalette,
            'settingsUser'       => $userModel->find($viewerId),
---
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = 5

    public function react(int $postId)
    {
        $guard = $this->requireUser();
        if ($guard !== null) {
            return $guard;
        }

        $reactionType = strtolower(trim((string) ($this->request->getPost('reaction_type') ?? '')));
        if (! in_array($reactionType, ['like', 'love', 'support', 'fire'], true)) {
            return $this->redirectToReferrer('feed')->with('error', 'Unsupported reaction.');
        }

        $post = (new SocialPostModel())->find($postId);
---
SELECT *
FROM `social_posts`
WHERE `social_posts`.`deleted_at` IS NULL
AND `social_posts`.`id` = 12

        }

        if ($this->request->isAJAX()) {
            $reactionRows = db_connect()->table('social_post_reactions')
                ->select('reaction_type, COUNT(*) as total')
                ->where('post_id', $postId)
                ->groupBy('reaction_type')
                ->get()->getResultArray();
---
SELECT `reaction_type`, COUNT(*) as total
FROM `social_post_reactions`
WHERE `post_id` = 12
GROUP BY `reaction_type`

    private function ensureProfile(int $userId): array
    {
        $profileModel = new SocialProfileModel();
        $profile = $profileModel->where('user_id', $userId)->first();
---
SELECT *
FROM `social_profiles`
WHERE `user_id` = 5
 LIMIT 1