app/Controllers/SocialController.php

SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = 5
---
    public function settings()
    {
        $guard = $this->requireUser();
        if ($guard !== null) {
            return $guard;
        }

        $viewer = $this->viewer();
        $viewerId = (int) $viewer['id'];
        $profile = $this->ensureProfile($viewerId);
        $userModel = new UserModel();
        $user = $userModel->find($viewerId);

SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = 5
---
            'currentUser'        => $viewer,
            'currentUserProfile' => $settingsProfile,
            'avatarPalette'      => $this->avatarPalette,
            'settingsUser'       => $userModel->find($viewerId),

SELECT *
FROM `social_posts`
WHERE `social_posts`.`deleted_at` IS NULL
AND `social_posts`.`id` = 40
---
    public function react(int $postId)
    {
        $guard = $this->requireUser();
        if ($guard !== null) {
            return $guard;
        }

        $reactionType = strtolower(trim((string) ($this->request->getPost('reaction_type') ?? '')));
        if (! in_array($reactionType, ['like', 'love', 'haha', 'wow', 'sad', 'angry'], true)) {
            return $this->redirectToReferrer('feed')->with('error', 'Unsupported reaction.');
        }

        $post = (new SocialPostModel())->find($postId);

SELECT `reaction_type`, COUNT(*) as total
FROM `social_post_reactions`
WHERE `post_id` = 40
GROUP BY `reaction_type`
---
            $reactionModel->save($payload);
        }

        $reactionRows = db_connect()->table('social_post_reactions')
            ->select('reaction_type, COUNT(*) as total')
            ->where('post_id', $postId)
            ->groupBy('reaction_type')
            ->get()->getResultArray();

SELECT *
FROM `comment_reactions`
WHERE `comment_id` = 64
AND `user_id` = 7
 LIMIT 1
---
    public function commentReact(int $commentId)
    {
        $guard = $this->requireUser();
        if ($guard !== null) {
            return $guard;
        }

        $reactionType = strtolower(trim((string) ($this->request->getPost('reaction_type') ?? '')));
        if (! in_array($reactionType, ['like', 'love', 'haha', 'wow', 'sad', 'angry'], true)) {
            return $this->response->setJSON(['ok' => false, 'error' => 'Invalid reaction.']);
        }

        $comment = (new SocialCommentModel())->find($commentId);
        if ($comment === null) {
            return $this->response->setJSON(['ok' => false, 'error' => 'Comment not found.']);
        }

        $viewerId = (int) $this->viewer()['id'];
        $reactionModel = new \App\Models\CommentReactionModel();

        $existing = $reactionModel
            ->where('comment_id', $commentId)
            ->where('user_id', $viewerId)
            ->first();

SELECT `reaction_type`, COUNT(*) as total
FROM `comment_reactions`
WHERE `comment_id` = 64
GROUP BY `reaction_type`
---
            $viewerReaction = $reactionType;
        }

        $breakdownRows = db_connect()->table('comment_reactions')
            ->select('reaction_type, COUNT(*) as total')
            ->where('comment_id', $commentId)
            ->groupBy('reaction_type')
            ->get()->getResultArray();

SELECT *
FROM `social_profiles`
WHERE `user_id` = 5
 LIMIT 1
---
    private function ensureProfile(int $userId): array
    {
        $profileModel = new SocialProfileModel();
        $profile = $profileModel->where('user_id', $userId)->first();