app/Controllers/SocialController.php

SELECT *
FROM `comment_reactions`
WHERE `comment_id` = 47
AND `user_id` = 5
 LIMIT 1
---
    public function commentReact(int $commentId)
    {
        $guard = $this->requireUser();
        if ($guard !== null) {
            return $guard;
        }

        $reactionType = strtolower(trim((string) ($this->request->getPost('reaction_type') ?? '')));
        if (! in_array($reactionType, ['like', 'love', 'haha', 'wow', 'sad', 'angry'], true)) {
            return $this->response->setJSON(['ok' => false, 'error' => 'Invalid reaction.']);
        }

        $comment = (new SocialCommentModel())->find($commentId);
        if ($comment === null) {
            return $this->response->setJSON(['ok' => false, 'error' => 'Comment not found.']);
        }

        $viewerId = (int) $this->viewer()['id'];
        $reactionModel = new \App\Models\CommentReactionModel();

        $existing = $reactionModel
            ->where('comment_id', $commentId)
            ->where('user_id', $viewerId)
            ->first();

SELECT `reaction_type`, COUNT(*) as total
FROM `comment_reactions`
WHERE `comment_id` = 47
GROUP BY `reaction_type`
---
            $viewerReaction = $reactionType;
        }

        $breakdownRows = db_connect()->table('comment_reactions')
            ->select('reaction_type, COUNT(*) as total')
            ->where('comment_id', $commentId)
            ->groupBy('reaction_type')
            ->get()->getResultArray();