app/Models/AdminCredentialModel.php

    public function getMasterCredentials()
    {
        return $this->first();
---
SELECT *
FROM `admin_credentials`
 LIMIT 1